mainconf/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

mainconf/InformationRegisters/ЦеныНоменклатурыПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыПоставщиков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

mainconf/Enums/ВидыЦенПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЦенПродаж</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Розничная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дисконт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

mainconf/CommonModules/РаботаСЦенами/Ext/Module.bsl
Функция ПолучитьЦенуПродажиНаДату (Номенклатура, ВидЦены) Экспорт
	
	Если ВидЦены = ПредопределенноеЗначение("Перечисление.ВидыЦенПродаж.ПустаяСсылка") Тогда
		ВидЦены = Перечисления.ВидыЦенПродаж.Розничная;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			,
	               |			Номенклатура = &Номенклатура
	               |				И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ВидЦены",ВидЦены);
    РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("В базе данных не найдены цены для данной номенклатуры!");
		возврат 0;
	КонецЕсли;	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
    Возврат Выборка.Цена;

КонецФункции                              


Функция ПолучитьЦенуПокупкиНаДату (Номенклатура, Поставщик) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Цена КАК Цена,
	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Поставщик КАК Поставщик
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(
	               |			,
	               |			Номенклатура = &Номенклатура
//	               |				И Период = &Период
	               |				И Поставщик = &Поставщик) КАК ЦеныНоменклатурыПоставщиковСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
//	Запрос.УстановитьПараметр("Период",Период); 
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
    РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("В базе данных не найдены цены для данной номенклатуры!");
		возврат 0;
	КонецЕсли;	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
    Возврат Выборка.Цена;

КонецФункции 


//Функция ПолучитьМассивЦен1 (Период, Поставщик, МассивНоменклатур) Экспорт
//	
//	МассивЦен = Новый Массив;
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура КАК Номенклатура,
//	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Цена КАК Цена,
//	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Поставщик КАК Поставщик
//	               |ИЗ
//	               |	РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(
//	               |			&Период,
//	               |			Поставщик = &Поставщик
//	               |				И Цена В (&МассивНоменклатур)) КАК ЦеныНоменклатурыПоставщиковСрезПоследних";
//	
//	Запрос.УстановитьПараметр("Период",Период); 
//	Запрос.УстановитьПараметр("Поставщик",Поставщик);
//	Запрос.УстановитьПараметр("МассивНоменклатур",МассивНоменклатур);

//    ЦеныНоменклатуры  = Запрос.Выполнить().Выгрузить();
//	
//    Возврат ЦеныНоменклатуры;

//КонецФункции 


//
